{
  "backend/main.mo": "Motoko actor implementing health tracking backend with functions to record daily fitness data (steps, water, calories), calculate/store BMI, reset daily data, retrieve weekly data, and manage per-user health records using Principal-based Map storage.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including home page, footer, dashboard with trackers, BMI calculator, and various pages with their associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files describing their purpose and key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including fitness-themed chart colors and sidebar variables.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'Body Fitness Tracking System', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Dashboard (protected), BMI Calculator, Features, About, Contact, Login, and Register pages, wrapped in ThemeProvider and Layout with Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying app title, college information (BYK College of Commerce, Academic Year 2025-26), team member (Rajeshwar Chaudhari), copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component with sticky header navigation bar, mobile menu toggle, dark/light theme switcher, authentication-aware login/logout buttons, and Footer component integration.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the login page using useAuth hook and useNavigate, protecting dashboard and other secure routes.",
  "frontend/src/components/StepCounter.tsx": "React component that displays a circular progress indicator for daily step count with a 10,000 step goal, includes an input field and update button to track steps.",
  "frontend/src/components/WaterIntakeTracker.tsx": "React component that tracks daily water intake in 250ml glasses with a 2000ml goal, displays progress bar and visual glass indicators, includes a button to add water.",
  "frontend/src/components/WeeklyChart.tsx": "React component that displays a 7-day bar chart visualization of health data (steps, water, calories) with gradient progress bars for each day.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP backend actor instance based on Internet Identity authentication state, automatically invalidating and refetching queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Custom React hook providing localStorage-based authentication with register, login, and logout functions for managing user sessions (legacy/fallback auth).",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing identity state, login flow, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React hook that provides TanStack Query wrappers for all backend canister methods including user data fetching, water intake tracking, daily data recording, BMI calculation, and data reset.",
  "frontend/src/index.css": "Global CSS file with Tailwind configuration, custom CSS variables for light/dark themes, fitness-themed color utilities (green, blue, orange, purple), and animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication, then renders the App component.",
  "frontend/src/pages/About.tsx": "Displays project information including description, problem statement, objectives, and technology stack using card components with icons. Academic project page for BYK College of Commerce fitness tracking system.",
  "frontend/src/pages/BMICalculator.tsx": "BMI calculator page with input fields for height and weight, calculates BMI via API mutation, displays result with color-coded category, and shows BMI category reference chart.",
  "frontend/src/pages/Contact.tsx": "Contact form page with name, email, and message fields, displays college contact information (address, phone, email) with icons, and simulates form submission with toast notifications.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying step counter, water intake tracker, calories burned, BMI info, and weekly chart with date picker and reset functionality. Integrates multiple tracking components and handles data mutations.",
  "frontend/src/pages/Features.tsx": "Features showcase page displaying six feature cards (smart tracking, analytics, BMI calculator, goal setting, reports, mobile design) with icons and descriptions, plus explanatory section about feature benefits.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring background image, project title by Rajeshwar Chaudhari, call-to-action button, and four feature preview cards highlighting key system capabilities.",
  "frontend/src/pages/Login.tsx": "Login page component with username/password form, authentication via useAuth hook, toast notifications, and navigation to dashboard on success.",
  "frontend/src/pages/Register.tsx": "Registration page component with username/password/confirm-password form, password validation (min 6 chars), duplicate username check, and redirect to login on success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme for fitness app styling, custom animations, and Poppins font family.",
  "project_state.json": "Project metadata defining a Body Fitness Tracking System with multi-page architecture, local storage persistence, Chart.js visualizations, and features including dashboard, BMI calculator, and tracking components."
}